; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	spectrograph5 - mode
	spectrograph0 - mode
	spectrograph3 - mode
	infrared2 - mode
	image4 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph3)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon13)
	(have_image Star5 image4)
	(have_image Star6 spectrograph0)
	(have_image Phenomenon7 spectrograph5)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 image4)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 spectrograph5)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 image4)
))

)

; plan
1. (turn_to satellite1 star2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star2)
   goals met: 0 of 17
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 17
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 17
4. (turn_to satellite1 phenomenon7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 17
5. (take_image satellite1 phenomenon7 instrument1 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 1 of 17
6. (turn_to satellite1 phenomenon12 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 17
7. (take_image satellite1 phenomenon12 instrument1 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 2 of 17
8. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 17
9. (turn_to satellite0 groundstation1 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 17
10. (take_image satellite1 phenomenon10 instrument1 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 3 of 17
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 17
12. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 17
13. (take_image satellite1 phenomenon10 instrument1 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 17
14. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 17
15. (take_image satellite0 phenomenon13 instrument0 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 5 of 17
16. (turn_to satellite0 phenomenon7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 17
17. (take_image satellite0 phenomenon7 instrument0 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 6 of 17
18. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 17
19. (take_image satellite0 phenomenon8 instrument0 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 7 of 17
20. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 7 of 17
21. (take_image satellite0 planet11 instrument0 spectrograph5)
   added: (have_image planet11 spectrograph5)
   goals met: 8 of 17
22. (turn_to satellite0 planet9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet9)
   goals met: 8 of 17
23. (take_image satellite0 planet9 instrument0 image4)
   added: (have_image planet9 image4)
   goals met: 9 of 17
24. (turn_to satellite0 star14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star14)
   goals met: 9 of 17
25. (take_image satellite0 star14 instrument0 image4)
   added: (have_image star14 image4)
   goals met: 10 of 17
26. (turn_to satellite0 star5 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star5)
   goals met: 10 of 17
27. (take_image satellite0 star5 instrument0 image4)
   added: (have_image star5 image4)
   goals met: 11 of 17
28. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 11 of 17
29. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 12 of 17
30. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 13 of 17
31. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 13 of 17
32. (take_image satellite1 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 14 of 17
33. (turn_to satellite1 planet9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet9)
   goals met: 14 of 17
34. (take_image satellite1 planet9 instrument1 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 15 of 17
35. (turn_to satellite1 phenomenon13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon13)
   goals met: 16 of 17
36. (take_image satellite1 phenomenon13 instrument1 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 17 of 17
